[
  {
    "slug": "groovepacker",
    "logo": "/img/company_logo/logo_bullhorn@3x.png",
    "backgroundImage": "/img/project_images/bullhorn.png",
    "subText": "Enhanced UI and ensured seamless user experience while improving maintainability.",
    "logoMobileWidth": 115,
    "logoMobileHeight": 44,
    "logoWidth": 211,
    "logoHeight": 80,
    "gradientColor": "rgba(254, 107, 1, 0), #fe6b01",
    "firstHeading": "GroovePacker: Revolutionizing UI and Deployments",
    "firstText": "GroovePacker is a platform aimed at improving user interaction and stability for its end users. Devntech’s collaboration with GroovePacker focused on enhancing the user interface, removing duplication, and achieving seamless experiences while maintaining the codebase.",
    "secondHeading": "Optimized Codebase and Bug Fixes",
    "secondText": "By identifying and resolving critical bugs, the team improved the application’s responsiveness and stability. Additionally, the codebase was optimized to remove redundancy, making it easier to maintain and scale.",
    "thirdHeading": "Achieving High Test Coverage",
    "thirdText": "Testing is critical to ensure functionality and reliability. Devntech implemented unit and integration tests using Jest and Enzyme, increasing test coverage to 80%. This significantly improved the platform’s stability.",
    "fourthHeading": "Deployment Pipelines for Seamless Rollouts",
    "fourthText": "A robust deployment pipeline ensured efficient rollouts of new features and updates, minimizing downtime for end users and improving overall development velocity."
  },
  {
    "slug": "huntwallet",
    "logo": "/img/company_logo/logo_elocker@3x.png",
    "backgroundImage": "/img/project_images/bullhorn.png",
    "subText": "Enhanced functionality and deployed stable apps for hunters using Expo and Next.js.",
    "logoMobileWidth": 110,
    "logoMobileHeight": 19,
    "logoWidth": 202,
    "logoHeight": 35,
    "gradientColor": "rgba(4, 178, 244, 0), #04b2f4",
    "firstHeading": "Hunt Wallet: Improving the Hunting Experience",
    "firstText": "Hunt Wallet is a utility-focused platform aimed at streamlining the planning process for hunters. Devntech contributed by implementing new features and fixing critical bugs for a seamless user experience.",
    "secondHeading": "App Stability and Bug Fixes",
    "secondText": "Identifying and resolving bugs ensured the app was stable, enhancing the experience for hunters relying on Hunt Wallet.",
    "thirdHeading": "Streamlined Deployment to Play Store and App Store",
    "thirdText": "By leveraging Expo, Devntech simplified the deployment process, ensuring the app reached a wide audience efficiently."
  },
  {
    "slug": "leafcloud",
    "logo": "/img/company_logo/logo_tastemedia@3x.png",
    "backgroundImage": "/img/project_images/tastemedia.png",
    "subText": "Built scalable serverless solutions with Next.js, TailwindCSS, and AWS.",
    "logoMobileWidth": 43,
    "logoMobileHeight": 44,
    "logoWidth": 79,
    "logoHeight": 81,
    "gradientColor": "rgba(245, 166, 35, 0), #f5a623",
    "firstHeading": "Leaf Cloud: Scalable and User-Friendly Cloud Solutions",
    "firstText": "Leaf Cloud is designed to provide serverless and scalable solutions for various users. Devntech built and optimized backend operations using AWS services and designed an intuitive UI.",
    "secondHeading": "Serverless Backend Using AWS",
    "secondText": "The backend was built with AWS services to ensure scalability and efficient operations, allowing the platform to handle variable traffic seamlessly.",
    "thirdHeading": "User Authentication and Subscription Management",
    "thirdText": "Devntech integrated Clerk for user authentication and Stripe for subscription management, enabling a secure and user-friendly experience."
  },
  {
    "slug": "discordbot",
    "logo": "/img/company_logo/logo_paved@3x.png",
    "backgroundImage": "/img/project_images/paved.png",
    "subText": "Automated attendance tracking and reporting for Discord users.",
    "logoMobileWidth": 75,
    "logoMobileHeight": 27,
    "logoWidth": 138,
    "logoHeight": 50,
    "gradientColor": "rgba(14, 99, 244, 0), #0e63f4",
    "firstHeading": "Discord Bot: Automating Attendance Tracking",
    "firstText": "Devntech developed a bot to automate daily attendance tracking for Discord users. This included features like leave reports and time tracking.",
    "secondHeading": "Integration with PostgreSQL for Scalability",
    "secondText": "PostgreSQL was utilized to store user data efficiently, ensuring the platform could handle large volumes of user activity.",
    "thirdHeading": "Advanced Reporting Features",
    "thirdText": "The bot provided detailed reporting features, enhancing the utility for both individual users and administrators."
  },
  {
    "slug": "payrollmanagement",
    "logo": "/img/company_logo/logo_rightHand@3x.png",
    "backgroundImage": "/img/project_images/bullhorn.png",
    "subText": "Comprehensive payroll management system with the MERN stack.",
    "logoMobileWidth": 109,
    "logoMobileHeight": 34,
    "logoWidth": 200,
    "logoHeight": 63,
    "gradientColor": "rgba(25, 175, 167, 0), #19afa7",
    "firstHeading": "Payroll Management System: Streamlining Payroll Processes",
    "firstText": "Devntech developed a robust payroll management system using the MERN stack. The platform offers automated workflows and efficient payroll management.",
    "secondHeading": "CI/CD Pipelines and Deployment",
    "secondText": "GitHub Actions were used to implement CI/CD pipelines, ensuring smooth deployments to AWS EC2.",
    "thirdHeading": "Automated Email Notifications",
    "thirdText": "Automated email notifications kept users informed about payroll updates, enhancing communication and user engagement."
  },
  {
    "slug": "aichatapp",
    "logo": "/img/company_logo/logo_alisuq@3x.png",
    "backgroundImage": "/img/project_images/tastemedia.png",
    "subText": "Integrated OpenAI's ChatGPT API for AI-driven conversational features.",
    "logoMobileWidth": 50,
    "logoMobileHeight": 49,
    "logoWidth": 91,
    "logoHeight": 89,
    "gradientColor": "rgba(212, 152, 43, 0), #d4982b",
    "firstHeading": "AI Chat App: Revolutionizing Communication with OpenAI",
    "firstText": "This chat app leverages OpenAI's ChatGPT API to offer advanced conversational features. Devntech integrated the API seamlessly into the platform, enabling intelligent interactions.",
    "secondHeading": "Real-Time AI Interactions",
    "secondText": "The app offers real-time AI-driven conversational features, providing users with dynamic and intuitive communication options.",
    "thirdHeading": "Scalable and Reliable Backend",
    "thirdText": "Devntech ensured the backend could handle high traffic and concurrent conversations, ensuring smooth operations at all times."
  }
]
